In [4]:
import pandas as pd

data = {
    "name" : ["Kamal", "Nimal", "Amal"],
    "age" : [25, 26, 27]
}

df= pd.DataFrame(data)
print(df)
print(type(df))

    name  age
0  Kamal   25
1  Nimal   26
2   Amal   27
<class 'pandas.core.frame.DataFrame'>

In [8]:
data = {
    "name" : ["Kamal", "Nimal", "Amal"],
    "age" : [25, 26, 27]
}

print(df.loc[0, 'name'])

Kamal

In [12]:
data = {
    "name" : ["Kamal", "Nimal", "Amal"],
    "age" : [25, 26, 27]
}

df= pd.DataFrame(data)
print(df)
print(f"\nOutput is: {df.iloc[2,1]}")

    name  age
0  Kamal   25
1  Nimal   26
2   Amal   27

Output is: 27

In [14]:
data = {
    "name" : ["Kamal", "Nimal", "Amal"],
    "age" : [25, 26, 27]
}

df= pd.DataFrame(data)
print(df)
print(f"\nOutput is: \n{df.loc[2]}")

    name  age
0  Kamal   25
1  Nimal   26
2   Amal   27

Output is:
name    Amal
age       27
Name: 2, dtype: object

In [15]:
data = {
    "name" : ["Kamal", "Nimal", "Amal"],
    "age" : [25, 26, 27]
}

df= pd.DataFrame(data)
print(df)
print(f"\nOutput is: \n{df.iloc[2]}")

    name  age
0  Kamal   25
1  Nimal   26
2   Amal   27

Output is:
name    Amal
age       27
Name: 2, dtype: object

In [26]:
# Change row label
data = {
    "name" : ["Alice", "Bob", "Charlie", "David"],
    "age" : [25, 30, 35, 40]
}

df= pd.DataFrame(data, index=["student_1", "student_2", "student_3", "student_4"])

print(df)

print(f"\n{df.iloc[1]}")

print(f"\n{df.loc["student_3"]}")

              name  age
student_1    Alice   25
student_2      Bob   30
student_3  Charlie   35
student_4    David   40

name    Bob
age      30
Name: student_2, dtype: object

name    Charlie
age          35
Name: student_3, dtype: object

In [32]:
data = {
    "name" : ["Alice", "Bob", "Charlie", "David"],
    "age" : [25, 30, 35, 40]
}

df= pd.DataFrame(data, index=["student_1", "student_2", "student_3", "student_4"])

print(f"\n{df.loc[["student_2","student_4"]]}")

            name  age
student_2    Bob   30
student_4  David   40

In [35]:
# Return Columns

data = {
    "name" : ["Alice", "Bob", "Charlie", "David"],
    "age" : [25, 30, 35, 40]
}

age_column = df['age']
print(age_column)

student_1    25
student_2    30
student_3    35
student_4    40
Name: age, dtype: int64

In [37]:
data = {
    "name" : ["Alice", "Bob", "Charlie", "David"],
    "age" : [25, 30, 35, 40]
}

print(df.columns)
print(list(df.columns))

Index(['name', 'age'], dtype='object')
['name', 'age']

In [39]:
data = {
    "name" : ["Alice", "Bob", "Charlie", "David"],
    "age" : [25, 30, 35, 40]
}

print(df.values)

[['Alice' 25]
 ['Bob' 30]
 ['Charlie' 35]
 ['David' 40]]

In [ ]:
data = {
    "name" : ["Alice", "Bob", "Charlie", "David"],
    "age" : [25, 30, 35, 40]
}

# Can be used numarical values
print(df['age'].mean())
print(df['age'].sum())

32.5
130

In [46]:
# Add new column 

data = {
    "name" : ["Alice", "Bob", "Charlie", "David"],
    "age" : [25, 30, 35, 40]
}

df["city"] = ["colombo", "kandy", "Galle", "Matara"]
df["salry"] = [50000, 60000, 70000, 80000]

print(df)

              name  age     city  salry
student_1    Alice   25  colombo  50000
student_2      Bob   30    kandy  60000
student_3  Charlie   35    Galle  70000
student_4    David   40   Matara  80000

In [50]:
print(df)

filter_df = df[df['age'] > 30]
print(f"\n {filter_df}")
print(f"\n {type(filter_df)}")

              name  age     city  salry
student_1    Alice   25  colombo  50000
student_2      Bob   30    kandy  60000
student_3  Charlie   35    Galle  70000
student_4    David   40   Matara  80000

               name  age    city  salry
student_3  Charlie   35   Galle  70000
student_4    David   40  Matara  80000

 <class 'pandas.core.frame.DataFrame'>

In [57]:
print(df)

filter_df = df[(df['age'] > 28) & (df['salry'] < 65000)]
print(f"\n{filter_df}")

              name  age     city  salry
student_1    Alice   25  colombo  50000
student_2      Bob   30    kandy  60000
student_3  Charlie   35    Galle  70000
student_4    David   40   Matara  80000

          name  age   city  salry
student_2  Bob   30  kandy  60000

In [ ]:
# Excersice

data = {
    "StudentId" : ["I001","I002","I003","I004","I005"],
    "Name" : ["Ayesha", "Nimal", "Tharindu", "Kasun", "Shashini"],
    "Assignment1" : [78, 65, 88, 50, 80],
    "Assignment2" : [85, 70, 90, 45, 75],
    "FinalExam" : [90, 72, 95, 60, 85]
}

df = pd.DataFrame(data)
print(df)

filter_df = df[df['FinalExam'] > 80]
print(f"\n{filter_df[['Name','FinalExam']]}")

# df["avarage"] = df[['Assignment1', 'Assignment2', 'FinalExam']].mean(axis=1)
# print(f"\n{df}")

df["avarage"] = (df['Assignment1'] + df['Assignment2'] + df['FinalExam']) / 3
print(f"\n{df}")
df


highest_avarage_score = df['avarage'].max()
max_avarage = df[df["avarage"] == highest_avarage_score]
print(f"\nHighest avarage score: {max_avarage[['Name', 'avarage']]}")

total_marks = df["Assignment1"].sum()
print(f"\nAssignment 1 Toatl marks : {total_marks}")

  StudentId      Name  Assignment1  Assignment2  FinalExam
0      I001    Ayesha           78           85         90
1      I002     Nimal           65           70         72
2      I003  Tharindu           88           90         95
3      I004     Kasun           50           45         60
4      I005  Shashini           80           75         85

       Name  FinalExam
0    Ayesha         90
2  Tharindu         95
4  Shashini         85

  StudentId      Name  Assignment1  Assignment2  FinalExam    avarage
0      I001    Ayesha           78           85         90  84.333333
1      I002     Nimal           65           70         72  69.000000
2      I003  Tharindu           88           90         95  91.000000
3      I004     Kasun           50           45         60  51.666667
4      I005  Shashini           80           75         85  80.000000

Highest avarage score:        Name  avarage
2  Tharindu     91.0

Assignment 1 Toatl marks : 361

  StudentId      Name  Assignment1  Assignment2  FinalExam    avarage
0      I001    Ayesha           78           85         90  84.333333
1      I002     Nimal           65           70         72  69.000000
2      I003  Tharindu           88           90         95  91.000000
3      I004     Kasun           50           45         60  51.666667
4      I005  Shashini           80           75         85  80.000000